In [1]:
import pandas as pd

In [2]:
# Series - 1 D object

In [7]:
list1 = [1,2,3,4]
list2 = [1,9,5,4]
print(list1)

[1, 2, 3, 4]

In [6]:
df1 = pd.DataFrame(list1,columns = ['Number 1'])
df1

   Number 1
0         1
1         2
2         3
3         4

In [8]:
df2 = pd.DataFrame(list2,columns = ['Number 2'])
df2

   Number 2
0         1
1         9
2         5
3         4

In [9]:
df = df1.join(df2)
df

   Number 1  Number 2
0         1         1
1         2         9
2         3         5
3         4         4

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.shape

(4, 2)

In [15]:
s = df['Number 2']
print(s)
print(type(s))

0    1
1    9
2    5
3    4
Name: Number 2, dtype: int64
<class 'pandas.core.series.Series'>

# DataFrame using Numpy

In [18]:
import numpy as np
a = np.arange(1,10,2)
b = np.random.randint(1,20,5)

array([12,  8,  5,  4, 15])

In [19]:
df1 = pd.DataFrame(a,columns = ['Number 1'])
df1

   Number 1
0         1
1         3
2         5
3         7
4         9

# Dictionaries for creating a dataframe

In [23]:
d = {'Person':['Mr X','Mr Y','Mr Z','Mr A','Mr B'],'Salary':b}

In [24]:
print(d)
print(type(d))

{'Person': ['Mr X', 'Mr Y', 'Mr Z', 'Mr A', 'Mr B'], 'Salary': array([12,  8,  5,  4, 15])}
<class 'dict'>

In [25]:
df = pd.DataFrame(d)
df

  Person  Salary
0   Mr X      12
1   Mr Y       8
2   Mr Z       5
3   Mr A       4
4   Mr B      15

# EDA on Spam - Ham

In [28]:
#df = pd.read_csv('Datasets/spam.tsv',sep = '\t')
df = pd.read_table('Datasets/spam.tsv')
df

     label                                            message  length  punct
0      ham  Go until jurong point, crazy.. Available only ...     111      9
1      ham                      Ok lar... Joking wif u oni...      29      6
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...     155      6
3      ham  U dun say so early hor... U c already then say...      49      6
4      ham  Nah I don't think he goes to usf, he lives aro...      61      2
...    ...                                                ...     ...    ...
5567  spam  This is the 2nd time we have tried 2 contact u...     160      8
5568   ham               Will ü b going to esplanade fr home?      36      1
5569   ham  Pity, * was in mood for that. So...any other s...      57      7
5570   ham  The guy did some bitching but I acted like i'd...     125      1
5571   ham                         Rofl. Its true to its name      26      1

[5572 rows x 4 columns]

In [29]:
df.shape

(5572, 4)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 4 columns):
label      5572 non-null object
message    5572 non-null object
length     5572 non-null int64
punct      5572 non-null int64
dtypes: int64(2), object(2)
memory usage: 174.2+ KB

In [31]:
df.columns

Index(['label', 'message', 'length', 'punct'], dtype='object')

In [34]:
x = df.iloc[:,1].values
print(x)
print(type(x))

['Go until jurong point, crazy.. Available only in bugis n great world la e buffet... Cine there got amore wat...'
 'Ok lar... Joking wif u oni...'
 "Free entry in 2 a wkly comp to win FA Cup final tkts 21st May 2005. Text FA to 87121 to receive entry question(std txt rate)T&C's apply 08452810075over18's"
 ... 'Pity, * was in mood for that. So...any other suggestions?'
 "The guy did some bitching but I acted like i'd be interested in buying something else next week and he gave it to us for free"
 'Rofl. Its true to its name']
<class 'numpy.ndarray'>

In [37]:
y = df.iloc[:,0].values
y

array(['ham', 'ham', 'spam', ..., 'ham', 'ham', 'ham'], dtype=object)

In [38]:
np.unique(y)

array(['ham', 'spam'], dtype=object)

In [39]:
unique_labels,counts = np.unique(y,return_counts = True)

In [40]:
print(counts)

[4825  747]

In [41]:
df.describe()

            length        punct
count  5572.000000  5572.000000
mean     80.489950     4.177495
std      59.942907     4.623919
min       2.000000     0.000000
25%      36.000000     2.000000
50%      62.000000     3.000000
75%     122.000000     6.000000
max     910.000000   133.000000

In [45]:
df_string = df.copy()
df_string = df_string.drop(columns = 'length')
df_string = df_string.drop(columns = 'punct')
df_string

     label                                            message
0      ham  Go until jurong point, crazy.. Available only ...
1      ham                      Ok lar... Joking wif u oni...
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...
3      ham  U dun say so early hor... U c already then say...
4      ham  Nah I don't think he goes to usf, he lives aro...
...    ...                                                ...
5567  spam  This is the 2nd time we have tried 2 contact u...
5568   ham               Will ü b going to esplanade fr home?
5569   ham  Pity, * was in mood for that. So...any other s...
5570   ham  The guy did some bitching but I acted like i'd...
5571   ham                         Rofl. Its true to its name

[5572 rows x 2 columns]

In [46]:
df_string['message'][0]

'Go until jurong point, crazy.. Available only in bugis n great world la e buffet... Cine there got amore wat...'

In [47]:
df_string.describe()

       label                 message
count   5572                    5572
unique     2                    5169
top      ham  Sorry, I'll call later
freq    4825                      30

In [48]:
#groupby

In [53]:
dg = df_string.groupby('label',sort = False)

In [54]:
dg.first()

                                                 message
label
ham    Go until jurong point, crazy.. Available only ...
spam   Free entry in 2 a wkly comp to win FA Cup fina...

In [58]:
dg.get_group('spam').head(10)

                                              message
2   Free entry in 2 a wkly comp to win FA Cup fina...
5   FreeMsg Hey there darling it's been 3 week's n...
8   WINNER!! As a valued network customer you have...
9   Had your mobile 11 months or more? U R entitle...
11  SIX chances to win CASH! From 100 to 20,000 po...
12  URGENT! You have won a 1 week FREE membership ...
15  XXXMobileMovieClub: To use your credit, click ...
19  England v Macedonia - dont miss the goals/team...
34  Thanks for your subscription to Ringtone UK yo...
42  07732584351 - Rodger Burns - MSG = We tried to...

In [59]:
df_string

     label                                            message
0      ham  Go until jurong point, crazy.. Available only ...
1      ham                      Ok lar... Joking wif u oni...
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...
3      ham  U dun say so early hor... U c already then say...
4      ham  Nah I don't think he goes to usf, he lives aro...
...    ...                                                ...
5567  spam  This is the 2nd time we have tried 2 contact u...
5568   ham               Will ü b going to esplanade fr home?
5569   ham  Pity, * was in mood for that. So...any other s...
5570   ham  The guy did some bitching but I acted like i'd...
5571   ham                         Rofl. Its true to its name

[5572 rows x 2 columns]

In [63]:
word_count = df_string['message'].str.contains('jurong').sum()
word_count

1